export class TheSevenWondersService
{
     private sevenWonders = [
        {
            id: 1,
            title: "Великая Китайская стена",
            description: "Великая Китайская стена — грандиозный архитектурный памятник и самая известная достопримечательность Китая, одно из Новых семи чудес света и объект всемирного наследия ЮНЕСКО.",
            imagePath: "https://img.tourister.ru/files/1/5/8/3/6/9/8/9/original.jpg"
        },

        {
            id: 2,
            title: "Колизей в Риме",
            description: "Колизей является одной из самых известных и посещаемых достопримечательностей Апеннинского полуострова. Монументальное сооружение античных времен располагается в историческом центре Рима, в самом сердце Вечного города. Оно поражает своим величием и сильнейшей энергетикой, вызывает желание притронуться к массивным травертиновым стенам и просто завораживает.",
            imagePath: "https://img.tourister.ru/files/1/5/5/3/5/3/4/0/original.jpg"
        },

        {
            id: 3,
            title: "Древний город Чичен-Ица",
            description: "Древний город индейцев майя Чичен-Ица занимает второе место по туристической привлекательности в Мексике, уступая лишь Теотиуакану. ЮНЕСКО еще в 80-х признало его объектом Всемирного наследия, однако популярность ему принес не статус и, увы, не уровень инфраструктуры, а медийный образ. В художественных романах и в книгах жанра нон-фикшн, в лентах от советского фильма «Воспоминания о будущем» до популярного сериала «X-Files» Чичен-Ица выступает местом контакта человечества с представителями неземных цивилизаций.",
            imagePath: "https://img.tourister.ru/files/2/4/5/3/4/6/4/1/original.jpg"
        },

        {
            id: 4,
            title: "Статуя Христа-Искупителя",
            description: "Статуя Христа в Рио-де-Жанейро (Cristo Redentor) — самый известный символ города и всей Бразилии. Входит в список «Новых семи чудес света». Находится на большой высоте над бывшей столицей на горе Корковаду, с которой открывается панорамный вид. Является самой посещаемой туристами достопримечательностью и одной из самых узнаваемых в мире. На вершину к ней возит старейшая железная дорога в стране.",
            imagePath: "https://img.tourister.ru/files/2/1/3/0/5/8/3/9/clones/870_580_fixedwidth.jpg"
        },

        {
            id: 5,
            title: "Древняя Петра",
            description: "Древняя Петра представляет собой уникальный скальный город, о котором вплоть до начала XIX в. было известно лишь местным бедуинам. Они веками хранили тайну, не подпуская чужаков, так как верили, что где-то здесь были спрятаны царские сокровища. Сегодня необычная достопримечательность открыта миллионам туристов.",
            imagePath: "https://img.tourister.ru/files/2/1/8/1/5/4/5/3/original.jpg"
        },

        {
            id: 6,
            title: "Тадж-Махал",
            description: "Мавзолей Тадж-Махал находится в городе Агра, штат Уттар-Прадеш. Это самое знаменитое здание в Индии и символ страны является удивительным, а также самым долговечным памятником индийской мусульманской архитектуры эпохи царствования Великих Моголов. Индийский поэт Рабиндранат Тагор назвал Тадж-Махал «слезой на щеке вечности».",
            imagePath: "https://img.tourister.ru/files/2/0/5/4/6/2/4/5/original.jpg"
        },

        {
            id: 7,
            title: "Мачу-Пикчу",
            description: "Мачу-Пикчу по праву считается одним из самых удивительных и загадочных мест на планете. Древняя цитадель инков является главной достопримечательностью Священной долины в Перу и относится к самым знаменитым руинам Южной Америки. Несмотря на достаточно трудный подъем, увидеть древний город своими глазами приезжают сотни тысяч туристов в год. В 1983 г. Национальный археологический парк-заповедник, включающий более 60 культурно-исторических памятников, появился в списках всемирного наследия ЮНЕСКО, а в 2007-м Мачу-Пикчу внесли в перечень «Новых семи чудес света».",
            imagePath: "https://img.tourister.ru/files/2/1/5/6/0/4/6/1/original.jpg"
        }
    ];

    getSewenWonders() {
        return this.sevenWonders;
    }
}